{
  "id": "attack-on-titan-lost-girls-947",
  "title": "Attack on Titan: Lost Girls",
  "malID": 36106,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/ae/9e/ae9effd6c9aba5c4ba6b68f2901c20c9/ae9effd6c9aba5c4ba6b68f2901c20c9.jpg",
  "description": "Wall Sina, Goodbye\nAnnie Leonhart has a job to do—and a resulting absence that must stay off her record at all costs. With no one else to turn to, she asks her comrade Hitch Dreyse to cover for her. She agrees but puts forward a single condition: Annie must solve the fruitless missing person case Hitch was assigned. The case revolves around Carly Stratmann, a university graduate and the daughter of wealthy businessman Elliot Stratmann. With only a single day to solve the case and the underground of the Stohess District crawling with thugs, Annie must put her all into finding this girl. Yet, every answer she uncovers only leads to further questions—how has the illegal drug coderoin found its way to Stohess, what is Elliot hiding, and where has Carly disappeared to?\n\nLost in the Cruel World\nWith worry for Eren Yeager gripping her heart, Mikasa Ackerman begins to remember. She remembers her conversations with Armin Arlert, her concern for her friends, and most painfully, the time she had almost lost everything. As fear takes control, she begins to experience an alternate version of her past—some things can be changed, but are there events so inescapable that she can't even prevent them in her dreams?\n\n[Written by MAL Rewrite]",
  "type": "OVA",
  "url": "https://aniwatch.to/attack-on-titan-lost-girls-947",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 3,
  "episodes": [
    {
      "id": "attack-on-titan-lost-girls-947$episode$15895$sub",
      "number": 1,
      "title": "Wall Sina, Goodbye (Part 1)",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/attack-on-titan-lost-girls-947?ep=15895"
    },
    {
      "id": "attack-on-titan-lost-girls-947$episode$15896$sub",
      "number": 2,
      "title": "Wall Sina, Goodbye (Part 2)",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/attack-on-titan-lost-girls-947?ep=15896"
    },
    {
      "id": "attack-on-titan-lost-girls-947$episode$15897$sub",
      "number": 3,
      "title": "Lost in the Cruel World",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/attack-on-titan-lost-girls-947?ep=15897"
    }
  ]
}