{
  "id": "dna-sights-9999-7715",
  "title": "DNA Sights 999.9",
  "malID": 2019,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/a4/76/a47698abeb0c27f568627d88e6b85f35/a47698abeb0c27f568627d88e6b85f35.jpg",
  "description": "After a meteor hits Earth, traitor forces have (for all intents and purposes) taken over, and the people are suffering. In the chaos, a boy named Tetsuro Daiba, who had lost his parents in the meteor hit, is paid a visit by Mello, a mysterious woman appearing in a bright light. When Daiba comes to, he finds himself in a spaceship infirmary under observation. Stealing a fighter that he didn't know how to pilot (until he tried it), he breaks out, flying like a total pro.\n\nHe was able to remember how to pilot from his DNA memory... and to find out more, his doctor friend takes him to his secret underground lab, in which he acts as a professor to find out ways to stop the traitor regime. When the forces invade to take him back, a girl named Rei Yuuki mysteriously shoots down their entire carrier with only a fighter jet! Apparently, both have mysterious powers that the enemies want, which may or may not be connected to their being the only two known survivors of the meteor impact.\n\nWhile looking for a third survivor (which turned out to be a cat), the two are taken by force to Queen Photon (ruler of the traitor regime), who claims that she is out to SAVE the Earth from those who sent the Meteor. The two don't know whether to believe her or Mello until the (telepathic) cat breaks them out of the Queen's sealed chamber, and Mello comes to straighten things out. That's when the two (er, three) of them make a choice... Stay on a planet that can't support their advanced race, or strike out into the unknown of space?",
  "type": "OVA",
  "url": "https://aniwatch.to/dna-sights-9999-7715",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "dna-sights-9999-7715$episode$95819$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/dna-sights-9999-7715?ep=95819"
    }
  ]
}