{
  "id": "eureka-seven-hi-evolution-3-15770",
  "title": "Eureka Seven Hi-Evolution 3",
  "malID": 35136,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/73/d2/73d2164b599bc254a92e1d2633b0d235/73d2164b599bc254a92e1d2633b0d235.jpg",
  "description": "The virtual world inside the scub coral (intelligent coral-like lifeforms) created by Eureka... The people from that virtual world appeared on Earth ten years ago when it collapsed. Since this large-scale amalgamation, the humans from the virtual world call themselves \"Green Earth\" and the original Earth humans call themselves \"Blue Earth,\" and they've come to cause various conflicts with each other repeatedly below the surface. Eventually, Dewey Novak, a senior officer in the Green Earth Armed Forces, rises together with his comrades and finally sets a large-scale terrorism plan into action in order to protect their own dignity.\n\nMeanwhile, Eureka, who is detested by the world as the main cause of the chaos, has become a high-grade combatant with the UN's A.C.I.D. unit. Live in order to keep this world at peace... This was the path of atonement she chose. One day, she receives an order to protect a girl named Iris, a new \"Eureka\" who has the ability to control scab coral. They fight a lot at first but gradually come to understand each other through their lonely escape. Soon the world faces a crisis, and when that happens, Eureka draws on every last ounce of her strength as she fights. \"I want to protect Iris and this world.\" What future awaits her at the end of that wish of hers?",
  "type": "MOVIE",
  "url": "https://aniwatch.to/eureka-seven-hi-evolution-3-15770",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "eureka-seven-hi-evolution-3-15770$episode$98408$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/eureka-seven-hi-evolution-3-15770?ep=98408"
    }
  ]
}