{
  "id": "gintama-yorinuki-gintama-san-on-theater-2d-121",
  "title": "Gintama: Yorinuki Gintama-san on Theater 2D",
  "malID": 21899,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/7c/18/7c18a17a0d32ce5f4a4c9faf7e1c8404/7c18a17a0d32ce5f4a4c9faf7e1c8404.jpg",
  "description": "Demonic Vice-Commander of the Shinsengumi, Toushirou Hijikata, acquires a cursed sword—one which completely rewrites his personality, morphing him from a hard-boiled, no-nonsense cop into a hopeless otaku. As he struggles to break the curse, an ambitious new member of the police force, Itou Kamotarou, seizes the opportunity to depose Hijikata in his bid for power within the organization. However, Itou's scheme is revealed to be more devious than anyone imagined, and the very existence of the Shinsengumi is thrown into peril.\n\nIn another time and place, the Yorozuya squad is suddenly greeted by a potential new recruit. Before them is a mysterious young woman named Pirako Doromizu who hides a penchant for extreme violence behind her smiling, enthusiastic exterior. However, unbeknownst to Gintoki and the others, Pirako has strong ties to one of the ruling figures of the Kabuki district of Edo, and her arrival sets off a chain reaction that throws the inhabitants of the district into a civil war.",
  "type": "MOVIE",
  "url": "https://aniwatch.to/gintama-yorinuki-gintama-san-on-theater-2d-121",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 2,
  "episodes": [
    {
      "id": "gintama-yorinuki-gintama-san-on-theater-2d-121$episode$3632$sub",
      "number": 1,
      "title": "Shinsengumi Crisis Arc",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/gintama-yorinuki-gintama-san-on-theater-2d-121?ep=3632"
    },
    {
      "id": "gintama-yorinuki-gintama-san-on-theater-2d-121$episode$3633$sub",
      "number": 2,
      "title": "Kabukicho Four Devas Arc",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/gintama-yorinuki-gintama-san-on-theater-2d-121?ep=3633"
    }
  ]
}