{
  "id": "godzilla-the-planet-eater-6735",
  "title": "Godzilla: The Planet Eater",
  "malID": 37897,
  "alID": 102353,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/2d/9e/2d9ef3a0b037c574d6b42b6a0bc61e77/2d9ef3a0b037c574d6b42b6a0bc61e77.jpg",
  "description": "A door opens, and a golden seal shatters a star.It is the early 21st century. Mankind has lost the battle for planet Earth to Godzilla, and has taken to the stars in search of a new home. But the search ends in vain, forcing them and their alien allies back to Earth. But 20,000 years have passed in their absence, and the Earth is a wholly different place.The planet's flora and fauna now embody and serve Godzilla. Earth is a monster's planet, ruled by the largest Godzilla ever at 300 meters in height. Godzilla Earth.Human protagonist, Captain Haruo, yearns to defeat Godzilla and retake the planet for mankind. There, he meets aboriginal descendants of the human race, the Houtua tribe. The Houtua twin sisters, Maina and Miana, lead him to the skeletal remains of Mecha-Godzilla, an old anti-Godzilla weapon, which to everyone's surprise is still alive in the form of self-generating nanometal. Taken from the Mecha-Godzilla carcass, the nanometals have gradually been rebuilding a \"Mecha-Godzilla City,\" a potential weapon capable of destroying Godzilla Earth.As the strategy develops, a rift forms between the humans and the Bilusaludo, one of several alien races that had joined the humans on their exodus from Earth. Their leader, Galu-gu, believes that the secret to defeating Godzilla lies in the use of superhuman powers – namely, the nanometal integration – but Haruo resists, fearing that in defeating monsters, they must not become monsters themselves. Haruo ultimately uses his means for defeating Godzilla Earth to destroy the Mecha-Godzilla city so as to prevent nanometal assimilation, killing Galu-gu. However, his childhood friend, Yuuko, has been absorbed by the nanometal integration and has fallen into a brain dead coma.The human race, once again, is lost. Metphies, commander of the priestly alien race, Exif, marvels at the miraculous survival of Haruo, he begins to attract a following. The Exif has secretly harbored this outcome as their \"ultimate goal.\" Miana and Maina issue warnings against Metphies, while Haruo begins to question mankind's next move.With no means for defeating Godzilla Earth, mankind watches as King Ghidorah, clad in a golden light, descends on the planet. The earth shakes once again with as war moves to a higher dimension.What is Godzilla exactly? Does mankind stand a chance? Is there a future vision in Haruo's eyes? Find out in the finale.(Source: Official site)",
  "type": "MOVIE",
  "url": "https://aniwatch.to/godzilla-the-planet-eater-6735",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "godzilla-the-planet-eater-6735$episode$58183$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/godzilla-the-planet-eater-6735?ep=58183"
    }
  ]
}