{
  "id": "jojos-bizarre-adventure-battle-tendency-17656",
  "title": "JoJo's Bizarre Adventure: Battle Tendency",
  "malID": 41306,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/c3/6c/c36c58895408997c82cb46883bfea0b0/c36c58895408997c82cb46883bfea0b0.jpg",
  "description": "In the series' backstory, 102,000 years ago in a place that would be modern-day Mexico, it started with a mysterious but powerful race with incredibly long lifespans and the ability to absorb life forces from plants and animals, although they had the disadvantage of being easily disintegrated if exposed to sunlight and thus lived underground instead. Kars, an underground-dwelling humanoid being known as a Pillar Man, created a stone mask which grants immortality by absorbing life energy to conquer the sun (which kills his kind). However, the stone mask cannot penetrate his head and unlock Kars' true potential. As he tirelessly slaughtered things for blood to activate the stone mask, his tribe begins to fear Kars for his obsession. When his tribe says Kars must be killed, Kars is angered and questions them if they want to conquer the sun. If they objected, Kars would say they will die. As his tribe attempts to kill him, Kars and his companion Esidisi fight back. He slaughtered all but four of the tribe.",
  "type": "MOVIE",
  "url": "https://aniwatch.to/jojos-bizarre-adventure-battle-tendency-17656",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 2,
  "episodes": [
    {
      "id": "jojos-bizarre-adventure-battle-tendency-17656$episode$72189$sub",
      "number": 1,
      "title": "First Half",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/jojos-bizarre-adventure-battle-tendency-17656?ep=72189"
    },
    {
      "id": "jojos-bizarre-adventure-battle-tendency-17656$episode$72190$sub",
      "number": 2,
      "title": "Second Half",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/jojos-bizarre-adventure-battle-tendency-17656?ep=72190"
    }
  ]
}