{
  "id": "kamierabi-godapp-18602",
  "title": "KamiErabi GOD.app",
  "malID": 54798,
  "alID": 162984,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/0a/ae/0aae292d628cd9dbd4cc54df0d7975f8/0aae292d628cd9dbd4cc54df0d7975f8.jpg",
  "description": "Gorou, a first-year high school student at a private high school in Tokyo, has no \"hopes,\" no \"dreams,\" and no \"ambitions.\" The world is \"indifferent\" to him, and he spends his boring, unchanging days with his best friend Akitsu while having a faint longing for Honoka, a classmate at the same school.  One day, Gorou receives a strange notification on his smartphone. \"You have been chosen. Please make a wish.\" Gorou thought it was malicious spam, so he tweeted, \"I want to do something naughty with my idol Honoka.\" The next day, he is invited by Honoka to pull down his pants in a deserted arcade... \"Congratulations on the fulfillment of your great desire!\" Then, a mysterious girl, Lall, suddenly appears. Confused by the series of events, Gorou is told of a cruel fate. Gorou was chosen by the \"Great Will\" to fulfill his wish, and in order to do so, he and the other Kamisama (God) candidates would kill each other for the title of \"God\" until there was only one left. The first candidate to appear as a potential Kamisama was, of course, Honoka, whom Gorou had longed for. What choice did Gorou make against Honoka, who attacked him mercilessly?",
  "type": "TV",
  "url": "https://aniwatch.to/kamierabi-godapp-18602",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 3,
  "episodes": [
    {
      "id": "kamierabi-godapp-18602$episode$107380$sub",
      "number": 1,
      "title": "Unnoticed by Anyone, in the Place of Which Everyone Dreams",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kamierabi-godapp-18602?ep=107380"
    },
    {
      "id": "kamierabi-godapp-18602$episode$107956$sub",
      "number": 2,
      "title": "He is strong or weak",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kamierabi-godapp-18602?ep=107956"
    },
    {
      "id": "kamierabi-godapp-18602$episode$108852$sub",
      "number": 3,
      "title": "Episode 3",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kamierabi-godapp-18602?ep=108852"
    }
  ]
}