{
  "id": "kishibe-rohan-wa-ugokanai-1444",
  "title": "Kishibe Rohan wa Ugokanai",
  "malID": 33191,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/a3/b7/a3b73730e8ff67c9474d6a9b07a2aade/a3b73730e8ff67c9474d6a9b07a2aade.jpg",
  "description": "Kishibe Rohan wa Ugokanai adapts a handful of one-shots based on the manga series JoJo no Kimyou na Bouken, and follows the bizarre adventures that Rohan Kishibe goes through as he searches for inspiration for his manga.\n\nFugou Mura\n\nRohan accompanies manga editor Kyouka Izumi to a secretive village where she plans on buying a house. Izumi informs Rohan that inhabitants of the village suddenly become rich at the age of 25 after purchasing their homes. Being 25 years old herself, Izumi has high hopes for moving into the village and invites Rohan to gather ideas for his manga. As they enter one of the houses for an interview with the seller, they are greeted by a servant named Ikkyuu, who puts them through a test of etiquette with deadly consequences.\n\nMutsukabezaka\n\nRohan meets with his editor, Minoru Kagamari, to discuss both his manga and the six mountains that the manga author recently bought. He explains that he purchased the mountains in order to search for a legendary spirit known as the Mutsukabezaka. To give his search context, he tells the tale of Naoko Osato, a wealthy heiress who murdered her boyfriend and became cursed by the spirit.\n\nZangenshitsu\n\nRohan decides to vacation in Venice after putting his manga on hiatus. While there, he explores the interior of a church and examines the structure of its confessional. After stepping into the priest's compartment, Rohan hears a man enter the confessional and begin to confess his sins. The man recounts his confrontation with a starving beggar and the haunting events that followed.\n\nThe Run\n\nYouma Hashimoto is a young male model who has quickly risen to success. As his popularity grows, so does his obsession with his appearance and body. One day, he meets Rohan at the gym, and the two quickly form a rivalry which pushes Youma to intensify his training. Soon. Youma's fixation on his physique takes a dark turn as his training takes precedence over his life, and he challenges Rohan to a fatal competition on the treadmills.\n\n[Written by MAL Rewrite]",
  "type": "OVA",
  "url": "https://aniwatch.to/kishibe-rohan-wa-ugokanai-1444",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 4,
  "episodes": [
    {
      "id": "kishibe-rohan-wa-ugokanai-1444$episode$20298$sub",
      "number": 1,
      "title": "Episode 5: Millionaire Village",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kishibe-rohan-wa-ugokanai-1444?ep=20298"
    },
    {
      "id": "kishibe-rohan-wa-ugokanai-1444$episode$20299$sub",
      "number": 2,
      "title": "Episode 2: Mutsu-kabe Hill",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kishibe-rohan-wa-ugokanai-1444?ep=20299"
    },
    {
      "id": "kishibe-rohan-wa-ugokanai-1444$episode$20300$sub",
      "number": 3,
      "title": "Episode 9: The Run",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kishibe-rohan-wa-ugokanai-1444?ep=20300"
    },
    {
      "id": "kishibe-rohan-wa-ugokanai-1444$episode$54193$sub",
      "number": 4,
      "title": "Episode 16: At a Confessional",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/kishibe-rohan-wa-ugokanai-1444?ep=54193"
    }
  ]
}