{
  "id": "le-portrait-de-petit-cossette-4142",
  "title": "Le Portrait de Petit Cossette",
  "malID": 514,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/d2/27/d22716fd7e62ec9f2bf5b2cf55c5860c/d22716fd7e62ec9f2bf5b2cf55c5860c.jpg",
  "description": "Eiri Kurahashi is a Japanese art student who works in an antique shop. His friends begin to notice a dramatic, and rather concerning, change in Eiri, as he becomes more absent-minded and his behavior completely changes. They quickly decide to blame their friend's troubles on a girl.\n\nThey may be right, however, as Eiri has begun seeing a beautiful, doll-like girl trapped within an antique Venetian glass that his uncle bought in France. She seems to be living in a strange other world, contained entirely inside this glass, but her image refuses to leave Eiri's mind. His sketchbook becomes filled with her likeness, and he realizes he has become completely infatuated with this strange little girl. When he recognizes her in a portrait by the mysterious Italian artist, Marchello Orlando, he learns her name is Cossette d’Auvergne, and that she was tragically murdered along with the rest of her family.\n\nOne night, as he closes up the shop, he hears a voice asking him not to leave. Finally making contact with the object of his obsession, he makes a deal that he doesn't fully understand.\n\n[Written by MAL Rewrite]",
  "type": "OVA",
  "url": "https://aniwatch.to/le-portrait-de-petit-cossette-4142",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 3,
  "episodes": [
    {
      "id": "le-portrait-de-petit-cossette-4142$episode$88595$both",
      "number": 1,
      "title": "Episode 1",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/le-portrait-de-petit-cossette-4142?ep=88595"
    },
    {
      "id": "le-portrait-de-petit-cossette-4142$episode$88596$both",
      "number": 2,
      "title": "Episode 2",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/le-portrait-de-petit-cossette-4142?ep=88596"
    },
    {
      "id": "le-portrait-de-petit-cossette-4142$episode$88597$both",
      "number": 3,
      "title": "Episode 3",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/le-portrait-de-petit-cossette-4142?ep=88597"
    }
  ]
}