{
  "id": "maquia-when-the-promised-flower-blooms-110",
  "title": "Maquia: When the Promised Flower Blooms",
  "malID": 35851,
  "alID": 99457,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/a9/b1/a9b19137629f50c8bf9cb40353ecd52b/a9b19137629f50c8bf9cb40353ecd52b.jpg",
  "description": "Maquia is a member of a special race called the Iorph—mystical beings who can live for hundreds of years and remain separate from the lives and daily troubles of mankind. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.One day however, the outside world finds her, as the power-hungry kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality of the Iorph to his bloodline.The humans and their Renato ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato that has gone berserk. It soon dies, and she is left deserted in a forest far from home, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her, or how to live with the smoldering loneliness inside, she is determined to make it all work somehow.[Written by MAL Rewrite]",
  "type": "MOVIE",
  "url": "https://aniwatch.to/maquia-when-the-promised-flower-blooms-110",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "maquia-when-the-promised-flower-blooms-110$episode$58281$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/maquia-when-the-promised-flower-blooms-110?ep=58281"
    }
  ]
}