{
  "id": "mazica-party-17704",
  "title": "Mazica Party",
  "malID": 48391,
  "alID": 130512,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/f0/48/f048c3f2bfe25155d54c310a0adba7c0/f048c3f2bfe25155d54c310a0adba7c0.jpg",
  "description": "The franchise's story centers on wizards who gather mazica in order to save the world. Junior high school student Kezuru wakes up after a strange dream featuring himself as a wizard, a creature called \"mazin,\" and a mysterious girl. The next day, his friend Kuracchi proudly shows off the newly launched Mazica Party card game. To Kezuru's shock, all the characters drawn in the game's cards are just like the ones in his dream.\n\nMeanwhile, Kezuru receives a notification for an event at the major international company Mazica. Intrigued, Kezuru goes to the Mazica Store as directed, only to meet the Mazica CEO himself, Jeff Johns. Johns says, \"I have great expectations for you,\" and hands Kezuru Mazica Gear.\n\nOn his way back home, Kezuru is attacked by an airship-like creature. Just when he thinks, \"this is it!\" to himself, his Mazica Gear erupts and a magic book appears. When he scratches a card, he seals a contract with Barunya, a \"mazin\" creature that is an odd remixed fusion between an airship and a cat.\n\nThe mysterious girl Anya says Kezuru and those of his ilk will be \"the true wizards who save the world.\" Amid all these mysterious revelations, Kezuru enrolls in the Mazica Academy and engages in Mazica Party card battles alongside his partner mazin.\n\n(Source: ANN)",
  "type": "TV",
  "url": "https://aniwatch.to/mazica-party-17704",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 5,
  "episodes": [
    {
      "id": "mazica-party-17704$episode$74057$sub",
      "number": 1,
      "title": "Episode 1",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/mazica-party-17704?ep=74057"
    },
    {
      "id": "mazica-party-17704$episode$74058$sub",
      "number": 2,
      "title": "Episode 2",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/mazica-party-17704?ep=74058"
    },
    {
      "id": "mazica-party-17704$episode$76307$sub",
      "number": 3,
      "title": "Episode 3",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/mazica-party-17704?ep=76307"
    },
    {
      "id": "mazica-party-17704$episode$84438$sub",
      "number": 4,
      "title": "Episode 4",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/mazica-party-17704?ep=84438"
    },
    {
      "id": "mazica-party-17704$episode$94925$sub",
      "number": 5,
      "title": "Episode 5",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/mazica-party-17704?ep=94925"
    }
  ]
}