{
  "id": "my-hero-academia-ona-18136",
  "title": "My Hero Academia ONA",
  "malID": 51781,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/dd/05/dd05c8c5b679ade2100781114e974160/dd05c8c5b679ade2100781114e974160.jpg",
  "description": "Episode 1: HLB  HLB stands for \"Hero League of Baseball\"—it is a baseball league founded by pro-heroes who love baseball!  It's game day! The last game of HLB championship is between Gang Orca and Shishido's two rival agencies. They form a team (\"Orcas\" and \"Lionels\") to compete. In the world of HLB, there is no rule—using their Quirks is of course accepted; however, just when the game is about to finish, they are interrupted by a villain. Who will be the winner of HLB?!   Episode 2: Laugh! As if you are in hell  Deku, Bakugo, and Todoroki participate in an internship under the No.1 hero, Endeavor's agency. One of their tasks these days is to find a villain (\"Smiley\") who draws doodles in the city; however, since the urgency is so low, they let other pro-heroes solve this case.  One day, Smiley draws a doodle on Endeavor's house! Being furious, Endeavor himself and the 1-A trio go out to get the villain' however, Smiley's Quirk turns out to be something ridiculous but powerful... It is to make anyone who looks into his eyes laugh hysterically!  Can the team capture the villain and stop laughing?!",
  "type": "ONA",
  "url": "https://aniwatch.to/my-hero-academia-ona-18136",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 2,
  "episodes": [
    {
      "id": "my-hero-academia-ona-18136$episode$93136$both",
      "number": 1,
      "title": "Hero League Baseball",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/my-hero-academia-ona-18136?ep=93136"
    },
    {
      "id": "my-hero-academia-ona-18136$episode$93137$both",
      "number": 2,
      "title": "Laugh! As If You Are in Hell",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/my-hero-academia-ona-18136?ep=93137"
    }
  ]
}