{
  "id": "myriad-colors-phantom-world-the-polka-dot-miracle-ova-4407",
  "title": "Myriad Colors Phantom World: The Polka Dot Miracle (OVA)",
  "malID": 33075,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/a6/49/a6498167d274f4d78512d5ca197fd7f3/a6498167d274f4d78512d5ca197fd7f3.jpg",
  "description": "The story starts with Haruhiko explaining about human sense of vision, as well as optical illusions and visual preconceptions. The students of Hosea Academy goes for a summer trip by the sea. During the trip, Haruhiko states that he hates summer, and wishes that he is inside his house reading... until the other boys point out about the swimsuits the girls would be wearing. When they arrived, they are told that even though there are a lot of visitors each year, a sudden appearance of a Phantom scares people away, so they are asked to exterminate the said Phantom. In return, the lodging and food fees will be free. That being said, when asked about what the Phantom did, the lodge house owner refused to say anything. The first day pass by without anything happened, and they thought that since there is no visitors, probably the Phantom had moved to somewhere else. Unable to sleep, Haruhiko and Mai have a small talk under the moonlight, and Ruru disturbs them when the mood is just good. Before they know it, Koito, Kurumi and Reina join the gathering as well. During the next day, they play by the sea. Attracted by the girls in swimsuits, the Phantom appears and shoots water beam towards them, making a polka dot censor to make an optical illusion of them naked. Despite trying their best while being embarrassed, their attacks have no effect at all. Haruhiko summons Marchosias and Chtulu and is able to repel the censor effect for a moment, but being angry, the Phantom enlarges itself and shoots a huge amount of water to the air, this time creating white censor bar, with the same effect as the previous censor. Two of Haruhiko's male friends already give in to temptation of seeing the naked illusion, but Shousuke reminds them that it's more erotic if \"you thought you can see it, but you can't\" (though they are defeated in the end anyway). Figuring out the basis of the Phantom's ability of manipulating light and temperature, Haruhiko asks Koito to surrounds the Phantom with her fire voice to disperse the effect. With the illusion ended, Mai uses the sea to increase her water techniques, while Kurumi uses Albrecht to throw the Phantom in the air, which ends up eaten by Reina. With the case finally resolved, they feel that they can enjoy the rest of the vacation, until Haruhiko come back from the sea (he was swept away by the current when Mai and Albrecht attack the Phantom) without his swimming trunks, now really naked instead of just an illusion. As the four main heroines run away out of embarrassment, an equally embarrassed Haruhiko shouts that he hates summer (though Ruru likes it).",
  "type": "OVA",
  "url": "https://aniwatch.to/myriad-colors-phantom-world-the-polka-dot-miracle-ova-4407",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "myriad-colors-phantom-world-the-polka-dot-miracle-ova-4407$episode$79044$sub",
      "number": 1,
      "title": "OVA",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/myriad-colors-phantom-world-the-polka-dot-miracle-ova-4407?ep=79044"
    }
  ]
}