{
  "id": "one-piece-episode-of-east-blue-634",
  "title": "One Piece: Episode of East Blue",
  "malID": 36215,
  "alID": 99302,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/12/27/122753b7529b699e7ee65e31bdd85e17/122753b7529b699e7ee65e31bdd85e17.jpg",
  "description": "The words that Gold Roger, the King of the Pirates, uttered just before his death excited the masses and the world has entered a Great Pirate Era! There is a group of young pirates who are about to set sail on the Grand Line. Monkey D. Luffy, a rubber man. Roronoa Zoro aka “Pirate Hunter.” Usopp, a sniper. Sanji, a seafaring cook. And “Cat Burglar” Nami. They, the Straw Hats, all place a foot upon a barrel and make their vows before their next journey across the great ocean. Luffy shouts “In order to be the King of the Pirates!” A decade ago in the Windmill Village... A little boy Luffy was enthralled with a pirate boss Red-Haired Shanks. But a group of mountain bandits shows up and makes fun of the pirates. “Why didn't you fight them?!” Luffy yells out angrily but Shanks says that it's nothing worth getting mad over. At that time, Luffy snatches the Gum-Gum Fruit from a treasure box and eats it and as a result, his entire body becomes rubber and he loses the ability to swim for the rest of his life! A few days later, Luffy is surrounded by the mountain bandits again and Shanks comes to help. “No matter what the reason, anyone who hurts my friends has to pay!!” Shanks and his pirate crew are incredibly strong and they beat down the mountain bandits. Higuma, the head of the mountain bandits, runs away kidnapping Luffy and heads for the sea. However, they encounter a local Sea Monster there and are attacked. Luffy is in a desperate situation... But again, Shanks saves the day. He outstares the Sea Monster and chases it away but in exchange, he loses his left arm... When Shanks leaves the village, he leaves his straw hat with Luffy. “Come bring it back to me someday! Once you've become a great pirate!” 10 years later, Luffy has grown up strong and he sets out for an adventure on a small boat. He again encounters the local Sea Monster for that fateful day. However, Luffy takes it down with a single blow of Gum-Gum Pistol. Luffy’s journey to become the King of the Pirates now begins!\n\n(Source: Crunchyroll)",
  "type": "SPECIAL",
  "url": "https://aniwatch.to/one-piece-episode-of-east-blue-634",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "one-piece-episode-of-east-blue-634$episode$73435$sub",
      "number": 1,
      "title": "Special",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/one-piece-episode-of-east-blue-634?ep=73435"
    }
  ]
}