{
  "id": "one-piece-the-movie-8-adventures-in-alabasta-2076",
  "title": "One Piece: The Movie 8 - Adventures in Alabasta",
  "malID": 2107,
  "alID": 2107,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/a2/3e/a23edd40c184ec10e6acfbf6771231ca/a23edd40c184ec10e6acfbf6771231ca.jpg",
  "description": "The film opens with Nefeltari Vivi flying with Pell in a brief flashback. Returning to the present, Vivi and the Straw Hats meet Crocodile's subordinate Mr. 2 Bon Clay. Mr. 2 shows the Straw Hats his devil fruit ability, which allows him to assume the form and voice of anyone whose face he has touched. Vivi describes a brief history on how the Baroque Works leader Crocodile has used Dance Powder while posing as the country's hero. He has also tricked the rebel and royal armies into fighting each other. Once in Alabasta and after crossing the desert, the Straw Hats find the rebel's base deserted, while the rebel army, led by Vivi's childhood friend Koza, witnesses the port town Nanohana being burned by members of Baroque Works disguised as soldiers of the royal army. The rebels decide to attack Alubarna, where at the same time Mr. 2 impersonates the king, Nefeltari Cobra, and orders the royal army to engage. Meanwhile in the desert, the Straw Hats are intercepted by Crocodile and his partner, Ms. All Sunday. Crocodile aims for Vivi, but Luffy stays behind and distracts him, while the other Straw Hats escape. In the ensuing fight, Crocodile defeats Luffy by impaling him through the chest with his hook and buried alive.",
  "type": "MOVIE",
  "url": "https://aniwatch.to/one-piece-the-movie-8-adventures-in-alabasta-2076",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "one-piece-the-movie-8-adventures-in-alabasta-2076$episode$58137$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/one-piece-the-movie-8-adventures-in-alabasta-2076?ep=58137"
    }
  ]
}