{
  "id": "paradox-live-the-animation-18601",
  "title": "Paradox Live the Animation",
  "malID": 51956,
  "alID": 150077,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/c8/23/c8238686a3ddc8932fcf2c2e00d2363b/c8238686a3ddc8932fcf2c2e00d2363b.jpg",
  "description": "Set in the near future...  From the saturated hip-hop culture rises a new movement—the Phantom Live. Using metals called \"phantom metals\" embedded into their accessories, the rappers create illusions (phantoms) that are linked to their emotions, through the chemical reaction of the metals with their DNA.  However, on the other side, there are those who suffer from \"phantom of trauma\" as a reaction after using the phantom metals.  Club PARADOX is suddenly back as the stage of the mysterious Paradox Live Battle, 10 years after the club's disappearance. Four units were invited to compete to win 10 billion yen worth of prize money and a right to challenge the legendary rapper unit called \"Buraikan.\"  These four groups, who are immensely popular with their respective genres, are BAE, The Cat's Whisker's, cozmez, and AkanYatsura. Each individual and as a team have their own reasons on accepting the invitation, and in order to prove that their own music is the number one, they participate in \"stage battles.\"  The curtains are raised to this illusionary stage battle where light and darkness come together in a swirling frenzy.",
  "type": "TV",
  "url": "https://aniwatch.to/paradox-live-the-animation-18601",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 3,
  "episodes": [
    {
      "id": "paradox-live-the-animation-18601$episode$107308$sub",
      "number": 1,
      "title": "Club Paradox",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/paradox-live-the-animation-18601?ep=107308"
    },
    {
      "id": "paradox-live-the-animation-18601$episode$107957$sub",
      "number": 2,
      "title": "Desire",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/paradox-live-the-animation-18601?ep=107957"
    },
    {
      "id": "paradox-live-the-animation-18601$episode$107960$sub",
      "number": 3,
      "title": "Justice",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/paradox-live-the-animation-18601?ep=107960"
    }
  ]
}