{
  "id": "robotech-ii-the-sentinels-17893",
  "title": "Robotech II: The Sentinels",
  "malID": 0,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/f2/e3/f2e3ba85e3e5822a18109d8ee9665695/f2e3ba85e3e5822a18109d8ee9665695.jpg",
  "description": "The Pioneer Expedition was a mission to confront alien forces in space to prevent interplanetary war on Earth. It took place concurrently with the 2nd and 3rd Robotech wars. The expedition was led by Lisa Hayes aboard the SDF-3, which was launched in 2022 in search of the Robotech Masters. The mission soon became preoccupied with the liberation of worlds under the control of the Invid Regent. In June 2030, the final battle of the Second Robotech War caused a release of the spores of the Invid flower of life across Earth, which soon attracted the Invid. In 2031, the Invid, under the control of the Regis, invaded Earth. The United Earth Forces (including the elite Army of the Southern Cross) had been severely weakened by the Second Robotech War and were only able to offer limited resistance. In less than a week, the Invid seized control of the planet and began utilizing the human population for slave labour and scientific experiments. In 2038 and 2042, the REF sent the 10th and 21st Mars divisions to try to retake the planet, but both ended in complete failure. It was only with the third attempt in 2044, which involved all available REF forces (now equipped with new technology known as new Reflex Weapons and Shadow Techno Fighters obtained from the Haydonites) that the Invid were dislodged from Earth.",
  "type": "MOVIE",
  "url": "https://aniwatch.to/robotech-ii-the-sentinels-17893",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "robotech-ii-the-sentinels-17893$episode$83128$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/robotech-ii-the-sentinels-17893?ep=83128"
    }
  ]
}