{
  "id": "robot-girls-z-5917",
  "title": "Robot Girls Z",
  "malID": 19799,
  "alID": 0,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/d2/de/d2de54261495ade76fa8f0868dcc3d17/d2de54261495ade76fa8f0868dcc3d17.jpg",
  "description": "The story revolves around a new team of \"Toei robot girls\" named \"Team Z\" that is made up of three girls based on Toei's Mazinger Z franchise: Mazinger Z, Great Mazinger, and UFO Robot Grendizer. Usually they perform in activities around Nerima ward in Tokyo to raise the awareness of the promising future energy source \"Photon Power\" (koushiryoku). However, there are times when \"Mechanical Beast\" team of girls emerge from the \"Subterranean Empire\" and attempt to steal the energy. Thus \"Team Z\" has to battle them to prevent this, though sometimes they just go and beat up the \"bad girls\" to relieve stress.\n\nPlease note that because in this particular case MAL lists airings, not episodes/chapters/parts, this show is considered to be 3 episodes and not 9. Each of the three airings consisted of three episodes for a total runtime of 27 minutes per airing. The duration on MAL reflects this.",
  "type": "SPECIAL",
  "url": "https://aniwatch.to/robot-girls-z-5917",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 3,
  "episodes": [
    {
      "id": "robot-girls-z-5917$episode$42970$sub",
      "number": 1,
      "title": "Awesome! The Might of Robot Girls Z \\ Terror! The Truth Behind the Underground Empire \\ Shocking! The Great Battle at the Numazu Coast",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/robot-girls-z-5917?ep=42970"
    },
    {
      "id": "robot-girls-z-5917$episode$42971$sub",
      "number": 2,
      "title": "Race! The Great Robot Girls Athletic Meet! \\ Shock!? The Appearance of a Mysterious Beauty \\ Steamy! Operation Hot Springs",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/robot-girls-z-5917?ep=42971"
    },
    {
      "id": "robot-girls-z-5917$episode$42972$sub",
      "number": 3,
      "title": "Fierce Battle! Baron Ashura Strikes Back! \\ Shock! The Last Day of Photonic Town! \\ The Robot Girls Z Die at Dawn!",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/robot-girls-z-5917?ep=42972"
    }
  ]
}