{
  "id": "ron-kamonohashis-forbidden-deductions-18582",
  "title": "Ron Kamonohashi's Forbidden Deductions",
  "malID": 53879,
  "alID": 158926,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/11/4a/114a624ebfada1fd3fe12991668cf810/114a624ebfada1fd3fe12991668cf810.jpg",
  "description": "Despite lacking the skills suited for his role on the Metropolitan Police Department investigative team, Totomaru Isshiki wants to solve murders and help people. Following the advice of one of his seniors, he ventures out to enlist the aid of the reclusive Ron Kamonohashi. Five years ago, Ron was the most promising detective from the illustrious Detective Training Academy Blue; yet for reasons unknown to the public, he sank into obscurity.  Totomaru expects a well-dressed, composed man; but what he gets is a messy-haired and uninhibited eccentric. After years in solitude, Ron barely resembles his former self and he refuses to even hear out the detective. However, as quickly as Ron rebuffs, he flips on a dime and dives headfirst into the current serial murder case.  The true reason Ron withdrew from the detective world was not from lack of desire, but rather from something out of his control—and Totomaru might just be the key for his return to his former calling. Together, the wide-eyed officer and deranged detective tackle each mystery that comes their way.",
  "type": "TV",
  "url": "https://aniwatch.to/ron-kamonohashis-forbidden-deductions-18582",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 3,
  "episodes": [
    {
      "id": "ron-kamonohashis-forbidden-deductions-18582$episode$107293$sub",
      "number": 1,
      "title": "The Case of the Metropolitan Serial Drownings",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/ron-kamonohashis-forbidden-deductions-18582?ep=107293"
    },
    {
      "id": "ron-kamonohashis-forbidden-deductions-18582$episode$107936$sub",
      "number": 2,
      "title": "The Case of the Locked-Room Piggy Bank Theft",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/ron-kamonohashis-forbidden-deductions-18582?ep=107936"
    },
    {
      "id": "ron-kamonohashis-forbidden-deductions-18582$episode$108660$sub",
      "number": 3,
      "title": "The Case of the Benizome Hot Spring Murder (Part 1)",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/ron-kamonohashis-forbidden-deductions-18582?ep=108660"
    }
  ]
}