{
  "id": "sarusuberi-miss-hokusai-2767",
  "title": "Sarusuberi: Miss Hokusai",
  "malID": 23987,
  "alID": 20709,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/38/c7/38c7ff6d282a074ee6016e4db95e71c6/38c7ff6d282a074ee6016e4db95e71c6.jpg",
  "description": "The time: 1814. The place: Edo, now known as Tokyo.One of the highest populated cities in the world, teeming with peasants, samurai, townsmen, merchants, nobles, artists, courtesans, and perhaps even supernatural things.A much accomplished artist of his time and now in his mid-fifties, Tetsuzo can boast clients from all over Japan, and tirelessly works in the garbage-loaded chaos of his house-atelier. He spends his days creating astounding pieces of art, from a giant-size Bodhidharma portrayed on a 180 square meter-wide sheet of paper, to a pair of sparrows painted on a tiny rice grain. Short-tempered, utterly sarcastic, with no passion for sake or money, he would charge a fortune for any job he is not really interested in.Third of Tetsuzo's four daughters and born out of his second marriage, outspoken 23-year-old O-Ei has inherited her father's talent and stubbornness, and very often she would paint instead of him, though uncredited. Her art is so powerful that sometimes leads to trouble. \"We're father and daughter; with two brushes and four chopsticks, I guess we can always manage, in a way or another.\"Decades later, Europe was going to discover the immense talent of Tetsuzo. He was to become best known by one of his many names: Katsushika Hokusai. He would mesmerize Renoir and van Gogh, Monet and Klimt.However, very few today are even aware of the woman who assisted him all his life, and greatly contributed to his art while remaining uncredited. This is the untold story of O-Ei, Master Hokusai's daughter: a lively portrayal of a free-spirited woman overshadowed by her larger-than-life father, unfolding through the changing seasons.(Source: Production I.G)",
  "type": "MOVIE",
  "url": "https://aniwatch.to/sarusuberi-miss-hokusai-2767",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "sarusuberi-miss-hokusai-2767$episode$58033$sub",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/sarusuberi-miss-hokusai-2767?ep=58033"
    }
  ]
}