{
  "id": "the-seven-deadly-sins-the-movie-2-cursed-by-light-17425",
  "title": "The Seven Deadly Sins the Movie 2: Cursed by Light",
  "malID": 46420,
  "alID": 128740,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/b2/1e/b21ef620ea4606687bc4215593a28928/b21ef620ea4606687bc4215593a28928.jpg",
  "description": "\"With the help of the \"Dragon Sin of Wrath\" Meliodas and the worst rebels in history, the Seven Deadly Sins, the \"Holy War\", in which four races, including Humans, Goddesses, Fairies and Giants fought against the Demons, is finally over. At the cost of the \"Lion Sin of Pride\" Escanor's life, the Demon King was defeated and the world regained peace. After that, each of the Sins take their own path; the first being the \"Boar Sin of Gluttony\" Merlin, who works together with King Arthur aiming to create a new kingdom.\"\n\n\"Meliodas was traveling with Princess Elizabeth to a place of memories. Along the way, by chance he reunites with his younger brother, Zeldris. Meanwhile, the wedding of Harlequin, the \"Bear Sin of Sloth\", and Diane, the \"Serpent Sin of Envy\", was about to take place, at a blessed ceremonial hall, with the presence of the \"Fox Sin of Greed\" Ban and the \"Goat Sin of Lust\" Gowther as well. With the advent of Diane in a dress, an eerie sound like the rumbling of the earth began to echo in the brilliant forest.\"\n\n\"Punish the Seven Deadly Sins that ruined the Holy War and those who contributed to it.\"\n\n\"Suddenly, an army of Fairies and Giants rushes to the land where peace should have come. Leading the enemy are the once missing \"Second Fairy King\" Dahlia and the \"Giant Master Craftsman\" Dubs. What is the purpose of the strange-eyed invaders...?\"\n\n\"Everyday life is destroyed by those who desire the chaos of the world. A terrifying conspiracy that threatens all races develops. What is the future ahead of the battle between light and darkness?! Can this cursed world have true peace? The fate of the fragile world is entrusted again to the reunited Seven Deadly Sins.\"",
  "type": "MOVIE",
  "url": "https://aniwatch.to/the-seven-deadly-sins-the-movie-2-cursed-by-light-17425",
  "subOrDub": "both",
  "hasSub": true,
  "hasDub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "the-seven-deadly-sins-the-movie-2-cursed-by-light-17425$episode$83385$both",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/the-seven-deadly-sins-the-movie-2-cursed-by-light-17425?ep=83385"
    }
  ]
}