{
  "id": "the-100-girlfriends-who-really-really-really-really-really-love-you-18580",
  "title": "The 100 Girlfriends Who Really, Really, Really, Really, Really Love You",
  "malID": 54714,
  "alID": 162694,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/91/8c/918c8b3557757782fcaf782ebe86d97f/918c8b3557757782fcaf782ebe86d97f.png",
  "description": "Upon graduating middle school, Rentarou Aijou manages to confess to the girl he loves. Unfortunately, he gets rejected, making it his 100th rejection in a row. Having experienced heartbreak after heartbreak, he goes to a matchmaking shrine and prays with the hope of finally getting a girlfriend in high school. Suddenly, the god of the shrine appears, promising Rentarou that he will meet one hundred soulmates in high school.  Although skeptical at first, Rentarou quickly acknowledges the truth behind the god's words when two of his soulmates—Hakari Hanazono and Karane Inda—confess to him the very same day that they meet him. However, there was one detail that the god forgot to tell Rentarou: if any of his soulmates fails to get into a relationship with him, they will die. Now trapped in a matter of life and death, Rentarou decides to date all of his soulmates.  With a heart so big that it can be shared among one hundred girlfriends, Rentarou makes the most out of his unanticipated high school life, with the Rentarou family growing ever larger!",
  "type": "TV",
  "url": "https://aniwatch.to/the-100-girlfriends-who-really-really-really-really-really-love-you-18580",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 2,
  "episodes": [
    {
      "id": "the-100-girlfriends-who-really-really-really-really-really-love-you-18580$episode$107920$sub",
      "number": 1,
      "title": "The 2 Girlfriends Who Really, Really, Really Love You (98 to Go)",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/the-100-girlfriends-who-really-really-really-really-really-love-you-18580?ep=107920"
    },
    {
      "id": "the-100-girlfriends-who-really-really-really-really-really-love-you-18580$episode$108647$sub",
      "number": 2,
      "title": "First Kiss",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/the-100-girlfriends-who-really-really-really-really-really-love-you-18580?ep=108647"
    }
  ]
}