{
  "id": "the-solitary-castle-in-the-mirror-18186",
  "title": "The Solitary Castle in the Mirror",
  "malID": 51116,
  "alID": 145739,
  "image": "https://img.flawlessfiles.com/_r/300x400/100/7f/0c/7f0c6b5c1b6f23c82cdcbfebf7633a3a/7f0c6b5c1b6f23c82cdcbfebf7633a3a.jpg",
  "description": "In a tranquil neighborhood of Tokyo, seven students are avoiding going to school—hiding in their darkened bedrooms, unable to face their family and friends—until the moment they find the mirrors in their bedrooms are shining.  At a single touch, they are pulled from their lonely lives into a wondrous castle straight out of a Grimm's fairy tale. This whimsical place, oddly lacking in food and running water but full of electrical sockets, is home to a petulant girl in a mask, named Wolf Queen and becomes their playground and refuge during school hours. Hidden within the walls, they're told there's a key that will grant one wish, as well as a set of clues to find it. But there's a catch: the key must be found by the end of the school year and they must leave the premises by five o'clock each day or else suffer a fatal end.  As time passes, a devastating truth emerges: only those brave enough to share their stories will be saved. And so they begin to unlock each other's stories: how a boy is showered with more gadgets than love; how another suffers a painful and unexplained rejection, and how a girl lives in fear of her predatory stepfather. As they struggle to abide by the rules of the game, a moving story unfolds, of seven characters trapped in a cycle of misunderstanding and loneliness, who are ultimately set free by the power of friendship, empathy, and sacrifice.",
  "type": "MOVIE",
  "url": "https://aniwatch.to/the-solitary-castle-in-the-mirror-18186",
  "subOrDub": "sub",
  "hasSub": true,
  "totalEpisodes": 1,
  "episodes": [
    {
      "id": "the-solitary-castle-in-the-mirror-18186$episode$107254$sub",
      "number": 1,
      "title": "Full",
      "isFiller": false,
      "url": "https://aniwatch.to/watch/the-solitary-castle-in-the-mirror-18186?ep=107254"
    }
  ]
}