{
  "id": "2941",
  "title": {
    "romaji": "Elysium",
    "english": null,
    "native": "엘리시움"
  },
  "malId": 2941,
  "synonyms": [
    "The Last Ark"
  ],
  "isLicensed": true,
  "isAdult": false,
  "countryOfOrigin": "KR",
  "image": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/2941.jpg",
  "popularity": 220,
  "color": "#e4501a",
  "cover": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/2941.jpg",
  "description": "In In the year 2113 A.D., a team of scientists is dispatched to Antarctica to investigate the region's abnormal seismic activity. Near the epicenter of the activity, the expedition discovers vast land markings akin to the Nazca paleoglyphs drawn in the Peruvian desert. Stranger still is the presence of an enormous underground cavern below these symbols. At the bottom of the chasm, a portion of a tremendous tower juts from the ground. Armed with ultra-digital cameras, the scientific team transmits their findings to the Command Center. One explorer traces the image of a star chart engraved on the tower's exterior. The tower begins to emit a sinister howling as if possessed by demonic forces. One by one, the members of the expedition writhe in pain and die. Those observing the scene at the Command Center watch helplessly. As the high-frequency noise suffuses their headquarters, they too succumb and die in agony. When the waves of the frequency are analyzed, they are discovered to be a beacon directed at the planet Elysium, which lies beyond Earth's solar system.<br><br>\nVan, the reluctant hero of the story, is an 18-year-old pizza delivery boy in Manhattan. He competes in the most popular sport of the 22nd century -- turbo jai alai racing. These races are fast paced and deadly affairs that integrate virtual reality into the competition. He's deeply in love with Lydia, a talented ballerina. In the chaotic futuristic metropolis, they only have each other and their dreams. Van and Lydia desperately want the chance to escape the polluted city-scape. Despite the dangers, Van enters a turbo jai alai race in the hopes of winning first prize -- two tickets to a galactic resort where Lydia can audition for the Jupiter Ballet.<br><br>\nMeanwhile, earth's deep space observation vessel, the Odyssey, patrols the planet's orbital perimeter. The Odyssey is confronted by an armada of sophisticated alien spacecraft from Elysium. The awed human crew prepares to receive the Elysian ambassador, Yaspe. Without warning, the Odyssey loses control of its weapons, fires on the ambassador's vessel and destroys it. This tragic misunderstanding results in brutal retaliation by the Elysian fleet, culminating in the destruction of the Odyssey and a full-scale attack on Earth.<br><br>\nVan's deadly sport of choice turns deadlier when the stadium he is competing in comes under fire from the Elysian barrage. Van struggles through the chaos on his turbo-cycle to rescue Lydia from the collapsing stands. The indiscriminate Elysian onslaught scorches cities worldwide. Van and Lydia flee through the burning streets of Manhattan seeking safety. After a series of harrowing escapes, they find refuge in a claustrophobic fall-out shelter. <br><br>\n(Source: AniDB)",
  "status": "Completed",
  "releaseDate": 2003,
  "startDate": {
    "year": 2003,
    "month": 8,
    "day": 15
  },
  "endDate": {
    "year": 2003,
    "month": 8,
    "day": 15
  },
  "totalEpisodes": 1,
  "currentEpisode": 1,
  "rating": 42,
  "duration": 75,
  "genres": [
    "Action",
    "Mecha",
    "Sci-Fi"
  ],
  "season": null,
  "studios": [],
  "subOrDub": "sub",
  "type": "MOVIE",
  "recommendations": [],
  "characters": [],
  "relations": [],
  "episodes": []
}